{
  "title": "Re-envision\nParticipation\nFinancing",
  "market": {
    "title": "The Market",
    "text": "The CRE syndication market is dominated by personal relationships\nand governed by big banks and brokers. Metechi aims to introduce\nthe AI based digital world to this booming financial market",
    "tiles": [
      {
        "icon": "About/about-banks.svg",
        "label": "Medium-Sized Banks",
        "text": "800"
      },
      {
        "icon": "About/about-senior.svg",
        "label": "Total CRE Senior debt portfolio",
        "text": "$2T"
      },
      {
        "icon": "About/about-total.svg",
        "label": "Total C&I portfolio",
        "text": "$500B"
      }
    ]
  },
  "team": {
    "title": "Our Team",
    "members": [
      {
        "name": "Zohar Goshen",
        "position": "",
        "img": "/images/about/Zohar.jpg",
        "linkedin": "https://www.linkedin.com/in/zohar-goshen-65a67/",
        "info": "Professor of Law, Columbia Law School, specializing in Corporate Law and Finance; Former Chairman of Israel’s SEC; Former Director, Israel Discount Bank."
      },
      {
        "name": "Ofer Krichman",
        "position": "",
        "img": "/images/about/Ofer.jpg",
        "linkedin": "https://www.linkedin.com/in/ofer-krichman/",
        "info": "More than 20 years’ experience in leading Israeli's financial institutions (via Logon, FMR, Psagot, Isracard, Discount Bank). Senior development & technology manager with experience in enterprise application solutions, innovation, architecture, design, implementation, and Fintech strategy. Ofer served in the IDF’s technology unit (Mamram) for eight years, and holds an MBA from the IDC Herzliya, and a BA in finance from Bar Ilan University, Israel."
      },
      {
        "name": "Keren Goshen",
        "position": "",
        "img": "/images/about/Keren.jpg",
        "linkedin": "https://www.linkedin.com/in/keren-goshen-748419151/",
        "info": "Co-founder with vast experience leading sales and operations. Multiple roles in Sales Management, Entrepreneurship, Business Development, Strategic Planning, HR, Marketing, and PR. Keren holds a B.A in Business & Marketing and an L.L.B in Law from the IDC Herzliya, Israel.        "
      },
      {
        "name": "Charles Greenwald",
        "position": "",
        "img": "/images/about/Charles.jpg",
        "linkedin": "https://www.linkedin.com/in/charles-greenwald-9bb69b16/",
        "info": "Joined Metechi from S&P Global Ratings where he led business development with corporate and financial institution entities.  Prior to S&P, he spent 10 years in banking covering Project Finance, Loan Workouts & Financial Institutions at Société Générale & National Australia Bank. Charles holds a BS in Finance and French from Tulane University.        "
      },
      {
        "name": "Stephanie Reiben",
        "position": "",
        "img": "/images/about/Stephanie.jpg",
        "linkedin": "https://www.linkedin.com/in/stephanie-rieben/",
        "info": "Joined Metechi after 10 years in Investment Banking in NYC (Goldman Sachs, Citigroup, and Berenberg). Prior she worked in E&Y’s Real Estate Advisory. Stephanie holds an MBA from Georgetown University and a BS in Hospitality Management from École Hôtelière de Lausanne.        "
      },
      {
        "name": "Tomer Lerner",
        "position": "",
        "img": "/images/about/Tomer.jpg",
        "linkedin": "https://www.linkedin.com/in/tomerlerner/",
        "info": "Leading design and product teams for more than 10 years across varied fields - machine learning and artificial intelligence, social networks, finance and editorial content. Winner of two Webby awards for user-experience and design."
      }
    ]
  }
}
